ahanbose18/loradashboard/STM32_Firmware/gps.c
/*
 * gps.c
 *
 *  Created on: Nov 15, 2019
 *      Author: Bulanov Konstantin
 *
 *  Contact information
 *  -------------------
 *
 * e-mail   :  leech001@gmail.com
 */

/*
 * |---------------------------------------------------------------------------------
 * | Copyright (C) Bulanov Konstantin,2019
 * |
 * | This program is free software: you can redistribute it and/or modify
 * | it under the terms of the GNU General Public License as published by
 * | the Free Software Foundation, either version 3 of the License, or
 * | any later version.
 * |
 * | This program is distributed in the hope that it will be useful,
 * | but WITHOUT ANY WARRANTY; without even the implied warranty of
 * | MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * | GNU General Public License for more details.
 * |
 * | You should have received a copy of the GNU General Public License
 * | along with this program.  If not, see <http://www.gnu.org/licenses/>.
 * |---------------------------------------------------------------------------------
 */


#include <stdio.h>
#include <string.h>
#include  "main.h"
#include "gps.h"
#include	"stm32l0xx_nucleo.h"


#if (GPS_DEBUG == 1)
#include <usbd_cdc_if.h>
#endif

//extern UART_HandleTypeDef huart1;

//#define	GPS_USART	&huart1
uint8_t rx_data = 0;
uint8_t rx_buffer[GPSBUFSIZE];
uint8_t rx_index = 0;

GPS_t GPS;

#if (GPS_DEBUG == 1)
void GPS_print(char *data){
	char buf[GPSBUFSIZE] = {0,};
	sprintf(buf, "%s\n", data);
	CDC_Transmit_FS((unsigned char *) buf, (uint16_t) strlen(buf));
}
#endif

void GPS_Init()
{
	HAL_UART_Receive_IT(GPS_USART, &rx_data, 1);
}



int GPS_Read()
{
	int i = 0;
	int RetCode;
	uint32_t tickstart = 0U;
	HAL_UART_Receive_IT(GPS_USART, &rx_data, 1);
	
	do
	{

	
	 	tickstart = HAL_GetTick();
		while (!HW_UART_Modem_IsNewCharReceived()) 
		{
			if((HAL_GetTick() - tickstart) > 5000)//ASYNC_EVENT_TIMEOUT) 
			{
				
				RetCode = 10; //(AT_UART_LINK_ERROR);
				break;
			}
		}
		if (10 ==RetCode) //AT_UART_LINK_ERROR == RetCode)
				break;
	
		rx_data = HW_UART_Modem_GetNewChar();
		if (rx_data != '\n' && rx_index < sizeof(rx_buffer)) 
		{
			rx_buffer[rx_index++] = rx_data;
		} 
		else 
		{

			#if (GPS_DEBUG == 1)
			GPS_print((char*)rx_buffer);
			#endif

			if(GPS_validate((char*) rx_buffer))
			{
				RetCode = GPS_parse((char*) rx_buffer);
				if ((RetCode ==1) || (RetCode ==2))
				{
					HAL_GPIO_TogglePin(LED2_GPIO_PORT, LED2_PIN);
					gGPS_longitude = GPS.dec_longitude;
					gGPS_latitude = GPS.dec_latitude;
				}
				
//				if ((RetCode ==1) || (RetCode ==2) || (RetCode == 3) || (RetCode ==4))
//				{
//					return 1;
//				}	
//				rx_index = 0;
//				memset(rx_buffer, 0, sizeof(rx_buffer));
			}
//			else
			{
				rx_index = 0;
				memset(rx_buffer, 0, sizeof(rx_buffer));
				return 0;
			}
			
		}
		HAL_UART_Receive_IT(GPS_USART, &rx_data, 1);
		i++;
	}while (i <100000);
	return 0;

}

void GPS_UART_CallBack(){
	if (rx_data != '\n' && rx_index < sizeof(rx_buffer)) {
		rx_buffer[rx_index++] = rx_data;
	} else {

		#if (GPS_DEBUG == 1)
		GPS_print((char*)rx_buffer);
		#endif

		if(GPS_validate((char*) rx_buffer))
			GPS_parse((char*) rx_buffer);
		rx_index = 0;
		memset(rx_buffer, 0, sizeof(rx_buffer));
	}
	HAL_UART_Receive_IT(GPS_USART, &rx_data, 1);
}


int GPS_validate(char *nmeastr){
    char check[3];
    char checkcalcstr[3];
    int i;
    int calculated_check;

    i=0;
    calculated_check=0;

    // check to ensure that the string starts with a $
    if(nmeastr[i] == '$')
        i++;
    else
        return 0;

    //No NULL reached, 75 char largest possible NMEA message, no '*' reached
    while((nmeastr[i] != 0) && (nmeastr[i] != '*') && (i < 75)){
        calculated_check ^= nmeastr[i];// calculate the checksum
        i++;
    }

    if(i >= 75){
        return 0;// the string was too long so return an error
    }

    if (nmeastr[i] == '*'){
        check[0] = nmeastr[i+1];    //put hex chars in check string
        check[1] = nmeastr[i+2];
        check[2] = 0;
    }
    else
        return 0;// no checksum separator found there for invalid

    sprintf(checkcalcstr,"%02X",calculated_check);
    return((checkcalcstr[0] == check[0])
        && (checkcalcstr[1] == check[1])) ? 1 : 0 ;
}
int16_t count = 0;
int  GPS_parse(char *GPSstrParse)
{
	uint16_t iRet= 0;
	char charst[10];
	char ch;
	
    if(!strncmp(GPSstrParse, "$GPGGA", 6))
	{
    	iRet =  sscanf(GPSstrParse, "$GPGGA,%f,%f,%c,%f,%c,%d,%d,%f,%f,%c", 
			&GPS.utc_time, &GPS.nmea_latitude, &GPS.ns, &GPS.nmea_longitude, &GPS.ew, &GPS.lock, &GPS.satelites, &GPS.hdop, &GPS.msl_altitude, &GPS.msl_units);
//    	iRet =  sscanf(GPSstrParse, "%s,%f", charst, &GPS.utc_time);
		if (iRet >= 1)
		{
    		GPS.dec_latitude = GPS_nmea_to_dec(GPS.nmea_latitude, GPS.ns);
    		GPS.dec_longitude = GPS_nmea_to_dec(GPS.nmea_longitude, GPS.ew);
			count++;
//			if (count == 30)
//					printf ("\n count reached");
//		HAL_GPIO_TogglePin(LED2_GPIO_PORT, LED2_PIN);
    		return 1;
    	}
    }
    else if (!strncmp(GPSstrParse, "$GPRMC", 6)){
    	if(sscanf(GPSstrParse, "$GPRMC,%f,%c,%f,%c,%f,%c", &GPS.utc_time, &ch, &GPS.nmea_latitude, &GPS.ns, &GPS.nmea_longitude, &GPS.ew) >= 1)
		{
    		GPS.dec_latitude = GPS_nmea_to_dec(GPS.nmea_latitude, GPS.ns);
    		GPS.dec_longitude = GPS_nmea_to_dec(GPS.nmea_longitude, GPS.ew);
    		return 2;
		}
    }
    else if (!strncmp(GPSstrParse, "$GPGLL", 6)){
        if(sscanf(GPSstrParse, "$GPGLL,%f,%c,%f,%c,%f,%c", &GPS.nmea_latitude, &GPS.ns, &GPS.nmea_longitude, &GPS.ew, &GPS.utc_time, &GPS.gll_status) >= 1)
		{
    		GPS.dec_latitude = GPS_nmea_to_dec(GPS.nmea_latitude, GPS.ns);
    		GPS.dec_longitude = GPS_nmea_to_dec(GPS.nmea_longitude, GPS.ew);
            return 3;
		}
    }
    else if (!strncmp(GPSstrParse, "$GPVTG", 6)){
        if(sscanf(GPSstrParse, "$GPVTG,%f,%c,%f,%c,%f,%c,%f,%c", &GPS.course_t, &GPS.course_t_unit, &GPS.course_m, &GPS.course_m_unit, &GPS.speed_k, &GPS.speed_k_unit, &GPS.speed_km, &GPS.speed_km_unit) >= 1)
            return 4;
    }
}

float GPS_nmea_to_dec(float deg_coord, char nsew) {
    int degree = (int)(deg_coord/100);
    float minutes = deg_coord - degree*100;
    float dec_deg = minutes / 60;
    float decimal = degree + dec_deg;
    if (nsew == 'S' || nsew == 'W') { // return negative
        decimal *= -1;
    }
    return decimal;
}
